
__author__ = 'Черепанов Дмитрий Евгеньевич'

''' 5. Реализовать структуру «Рейтинг», представляющую собой набор натуральных чисел, который
не возрастает. У пользователя нужно запрашивать новый элемент рейтинга. Если в рейтинге
существуют элементы с одинаковыми значениями, то новый элемент с тем же значением
должен разместиться после них.
Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
Пользователь ввёл число 3. Результат: 7, 5, 3, 3, 3, 2.
Пользователь ввёл число 8. Результат: 8, 7, 5, 3, 3, 2.
Пользователь ввёл число 1. Результат: 7, 5, 3, 3, 2, 1.

Набор натуральных чисел можно задать сразу в коде, например, my_list = [7, 5, 3, 3, 2].'''

my_list = [7, 5, 3, 3, 2]
int_number = int(input('New element: '))
my_list.append(int_number)
my_list = sorted(my_list, reverse=True)
print(my_list)
