
__author__ = 'Черепанов Дмитрий Евгеньевич'

''' 7. Создать вручную и заполнить несколькими строками текстовый файл, в котором каждая
строка будет содержать данные о фирме: название, форма собственности, выручка, издержки.
Пример строки файла: firm_1 ООО 10000 5000.
Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также
среднюю прибыль. Если фирма получила убытки, в расчёт средней прибыли её не включать.
Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а
также словарь со средней прибылью. Если фирма получила убытки, также добавить её в
словарь (со значением убытков).
Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
Итоговый список сохранить в виде json-объекта в соответствующий файл.
Пример json-объекта:
[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
Подсказка: использовать менеджер контекста.'''

import json

with open(r'file_for_7_question.txt', encoding='utf-8') as f:
    dict_ = {firm: float(income) - float(outcome) for firm, _, income, outcome in 
        map(lambda s: s.split(' '), f)}
    profits = [value for value in dict_.values() if value >= 0]
    list_ = [dict_, {'average_profit': sum(profits) / len(profits)}]
    with open(r'firms_profit.json', 'w', encoding='utf-8') as f_out:
        json.dump(list_, f_out)
