
__author__ = 'Черепанов Дмитрий Евгеньевич'

''' 3) Реализовать программу работы с органическими клетками, состоящими из ячеек. Необходимо
создать класс Клетка. В его конструкторе инициализировать параметр, соответствующий
количеству ячеек клетки (целое число). В классе должны быть реализованы методы
перегрузки арифметических операторов: сложение (__add__()), вычитание (__sub__()),
умножение (__mul__()), деление (__truediv__()). Данные методы должны применяться только
к клеткам и выполнять увеличение, уменьшение, умножение и целочисленное (с округлением
до целого) деление клеток, соответственно.
Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться
сумме ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность
количества ячеек двух клеток больше нуля, иначе выводить соответствующее сообщение.
Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как
произведение количества ячеек этих двух клеток.
Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как
целочисленное деление количества ячеек этих двух клеток.
В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и
количество ячеек в ряду. Данный метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n
равно переданному аргументу. Если ячеек на формирование ряда не хватает, то в последний
ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод
make_order() вернет строку: *****\n*****\n**.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод
make_order() вернет строку: *****\n*****\n*****.
Подсказка: подробный список операторов для перегрузки доступен по ссылке.'''


class Cell:
    def __init__(self, n):
        self.n = n


    def __add__(self, other):
        return Cell(self.n + other.n)

    
    def __sub__(self, other):
        new_n = self.n - other.n
        if new_n > 0:
            return Cell(new_n)
        else:
            raise ValueError('Ошибка: во второй клетке больше ячеек.')

    
    def __mul__(self, other):
        return Cell(self.n * other.n)


    def __truediv__(self, other):
        return Cell(self.n // other.n)


    def make_order(self, n_in_line):
        mod = self.n % n_in_line
        return '\n'.join([n_in_line * '*' for _ in
            range(self.n // n_in_line)]) if mod == 0 else '\n'.join([n_in_line * '*'
            for _ in range(self.n // n_in_line)] + [self.n % n_in_line * '*'])


if __name__ == '__main__':
    cell_1 = Cell(10)
    cell_2 = Cell(25)
    sum_cell = cell_1 + cell_2
    dif_cell = cell_2 - cell_1
    mul_cell = cell_1 * cell_2
    div_cell = cell_2 / cell_1
    n_in_line = 30
    print(f'Sum:\n{sum_cell.make_order(n_in_line)}\n')
    print(f'Dif:\n{dif_cell.make_order(n_in_line)}\n')
    print(f'Mul:\n{mul_cell.make_order(n_in_line)}\n')
    print(f'Div:\n{div_cell.make_order(n_in_line)}\n')
    try:
        dif_cell_2 = cell_1 - cell_2
    except Exception as e:
        print(e)
